export default {
  projections: {
    ДоступE: {
      кодДоступа: {
        __caption__: 'Код доступа'
      },
      доступ: {
        __caption__: 'Доступ'
      },
      смартКлюч: {
        __caption__: 'Смарт ключ',
        кодКлюча: {
          __caption__: 'Код смарт ключа'
        },
        статус: {
          __caption__: 'Статус смарт ключа'
        }
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        фИО: {
          __caption__: 'ФИО'
        }
      },
      комната: {
        __caption__: 'Комната',
        кодКомнаты: {
          __caption__: 'Код комнаты'
        },
        класс: {
          __caption__: 'Класс комнаты'
        },
        колвоМест: {
          __caption__: 'Количество мест '
        },
        стоимость: {
          __caption__: 'Стоимотсь комнаты в день'
        }
      },
      регистрЗаписи: {
        __caption__: 'Регистр записи',
        кодРегистра: {
          __caption__: 'Код регистра'
        },
        датаЗаселения: {
          __caption__: 'Дата заселения'
        },
        датаВыезда: {
          __caption__: 'Дата выезда'
        }
      },
      гости: {
        __caption__: 'Гости',
        кодГостя: {
          __caption__: 'Код гостя'
        },
        фИО: {
          __caption__: 'ФИО'
        },
        комментарий: {
          __caption__: 'Комментарий'
        }
      }
    },
    ДоступL: {
      кодДоступа: {
        __caption__: 'Код доступа'
      },
      доступ: {
        __caption__: 'Доступ'
      },
      смартКлюч: {
        __caption__: 'Статус смарт ключа',
        статус: {
          __caption__: 'Статус смарт ключа'
        }
      },
      сотрудник: {
        __caption__: 'ФИО',
        фИО: {
          __caption__: 'ФИО'
        }
      },
      комната: {
        __caption__: 'Код комнаты',
        кодКомнаты: {
          __caption__: 'Код комнаты'
        }
      }
    }
  },
  validations: {
    доступ: {
      __caption__: 'Доступ'
    },
    кодДоступа: {
      __caption__: 'Код доступа'
    },
    комната: {
      __caption__: 'Комната'
    },
    смартКлюч: {
      __caption__: 'Смарт ключ'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    },
    регистрЗаписи: {
      __caption__: 'Регистр записи'
    },
    гости: {
      __caption__: 'Гости'
    }
  }
};
